In [1]:
import pandas as pd

#### Creating data frame

In [2]:
dict1 = {'name':['Ram', 'Shyam', 'Hari'], 'age':[23, 45, 67]}
df = pd.DataFrame(dict1)
df

    name  age
0    Ram   23
1  Shyam   45
2   Hari   67

#### Importing from csv

In [3]:
df=pd.read_csv('abc.csv')
df.head() #tail

     name   age  gender
0     ram  20.0    male
1    sita  34.0  female
2  roshan  23.0    male
3   mohan   NaN    male
4  asmita  23.0  female

#### Basic Functionalities

In [4]:
# shape, size
print(df.shape)
print(df.size)

(5, 3)
15

In [5]:
# describe
df.describe()

             age
count   4.000000
mean   25.000000
std     6.164414
min    20.000000
25%    22.250000
50%    23.000000
75%    25.750000
max    34.000000

In [6]:
#dtypes
df.dtypes

name       object
age       float64
gender     object
dtype: object

In [7]:
# columns, index 
print(df.columns)
print(df.index)

Index(['name', 'age', 'gender'], dtype='object')
RangeIndex(start=0, stop=5, step=1)

In [16]:
# Values in array
print(df.values)
print(type(df.values))

[['ram' 20.0 'male']
 ['sita' 34.0 'female']
 ['roshan' 23.0 'male']
 ['mohan' nan 'male']
 ['asmita' 23.0 'female']]
<class 'numpy.ndarray'>

In [9]:
# Transpose
df.T

           0       1       2      3       4
name     ram    sita  roshan  mohan  asmita
age     20.0    34.0    23.0    NaN    23.0
gender  male  female    male   male  female

In [10]:
# Sorting dataframe
df.sort_values(by=['age'])

     name   age  gender
0     ram  20.0    male
2  roshan  23.0    male
4  asmita  23.0  female
1    sita  34.0  female
3   mohan   NaN    male

In [11]:
# slicing data frame using iloc
df.iloc[:,0:1]

     name
0     ram
1    sita
2  roshan
3   mohan
4  asmita

In [12]:
# finding Null Values
df.isnull()

    name    age  gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False   True   False
4  False  False   False

#### Summary Statistics

In [13]:
print(df.age.mean())
print(df.age.median())
print(df.age.mode()[0])
print(df.age.min())
print(df.age.max())
print(df.age.sum())
print(df.age.quantile(0.25))

25.0
23.0
23.0
20.0
34.0
100.0
22.25